backend/controllers/LoginController.php

	public function actionLogin()
	{
		$request = Yii::$app->request;
		$session = Yii::$app->session;
		if($request->isPost)
		{
			$user = $request->post();
			$userObj = User::find()->where(['username'=>$user['username'], 'password'=>$user['password']])->asArray()->one();
---
SELECT * FROM `user` WHERE (`username`='张三') AND (`password`='123')

	public function actionShow()
	{
		$request = Yii::$app->request;
		$session = Yii::$app->session;
		$uid = $session->get('uid');
		$query = (new \yii\db\Query())		//用户权限
				//->select()
				->from('u_c')
				->leftJoin('user', 'user.uid = u_c.uid')
				->leftJoin('categary as c', 'c.cid = u_c.cid')
				->where(['u_c.uid'=>$uid])
				->all();
		//var_dump($query);die;
		if(!empty($query))
		{
			$uTime = User::find()->select('uid, time, username')->asArray()->all();
---
SELECT `uid`, `time`, `username` FROM `user`