advanced/frontend/controllers/ArticleController.php

INSERT INTO `article` (`title`, `content`, `addtime`, `author`, `c_number`) VALUES ('dddddddddddddddddddddddddddddd', 'sdddddddddddddddddddf', 1574456845, 'tttttttttttttt', 20)
---
    public function actionCreate()
    {
        $model = new Article();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `article` WHERE `aid`='202'
---
    protected function findModel($id)
    {
        if (($model = Article::findOne($id)) !== null) {